In [1]:
import pandas as pd

In [2]:
data2 = pd.read_excel('DDW-C19-0000.xlsx')

In [3]:
new_col = ['state','District','Area','Total','Edu-level','S_persons','S_males','S_females','T_persons','T_males','T_females']

In [4]:
data2.columns = new_col

In [5]:
data2 = data2.iloc[5:]

In [6]:
new_data2 = data2.copy(deep=True)

In [7]:
new_data2 = new_data2[new_data2['Total']=='Total'].copy()

In [8]:
new_data2 = new_data2[['state','Area','Edu-level','T_persons']].copy()

In [9]:
the = new_data2[new_data2['Area']=='INDIA']['Edu-level'].to_list()

In [10]:
d = pd.read_excel('DDW-0000C-08.xlsx')

In [11]:
d_col = ['table_name','state_code','dist_code','area_name','tot/urb/rur','age_group','tot_persons','tot_males','tot_females','illiterate_persons','illiterate_males','illiterate_females','literate_persons','literate_males','literate_females','literate_without_edu_level_persons','literate_without_edu_level_males','literate_without_edu_level_females','below_primary_persons','below_primary_males','below_primary_females','primary_persons','primary_males','primary_females','middle_persons','middle_males','middle_females','matric_persons','matric_males','matric_females','intermediate_persons','intermediate_males','intermediate_females','non_tech_diploma_persons','non_tech_diploma_males','non_tech_diploma_females','tech_diploma_persons','tech_diploma_males','tech_diploma_females','graduate_and_above_persons','graduate_and_above_males','graduate_and_above_females','unclassified_persons','unclassified_persons_males','unclassified_persons_females']

In [12]:
d.columns = d_col

In [13]:
d = d[6:]

In [14]:
d = d[['state_code','area_name','tot/urb/rur','tot_persons','illiterate_persons','literate_persons','literate_without_edu_level_persons','below_primary_persons','primary_persons','middle_persons','matric_persons','intermediate_persons','non_tech_diploma_persons','tech_diploma_persons','graduate_and_above_persons','unclassified_persons']].copy()

In [15]:
d = d[d['tot/urb/rur']=='Total'].copy()

In [16]:
d.drop_duplicates(subset =["area_name",'tot/urb/rur'],keep = 'first', inplace = True)

In [17]:
d.head()

,state_code,area_name,tot/urb/rur,tot_persons,illiterate_persons,literate_persons,literate_without_edu_level_persons,below_primary_persons,primary_persons,middle_persons,matric_persons,intermediate_persons,non_tech_diploma_persons,tech_diploma_persons,graduate_and_above_persons,unclassified_persons
6,00,INDIA,Total,1210854977,447216165,763638812,35153231,146897597,184170833,133903266,105939743,77942593,1072289,7238719,68288971,3031570
93,01,State - JAMMU & KASHMIR,Total,12541302,5474069,7067233,195783,987774,1285909,1666381,1411973,776437,4781,50822,653764,33609
180,02,State - HIMACHAL PRADESH,Total,6864602,1824866,5039736,130023,611475,1162995,826611,1127997,662457,8519,53413,446609,9637
267,03,State - PUNJAB,Total,27743338,9036201,18707137,566332,2227684,4288200,3066305,4186373,2310511,24287,234365,1760846,42234
354,04,State - CHANDIGARH,Total,1055450,250012,805438,11254,90869,130243,111879,142206,107599,1506,13801,194453,1628

In [18]:
d['total_literate'] = d['literate_persons'] + d['unclassified_persons'] + d['literate_without_edu_level_persons'] + d['illiterate_persons']

In [19]:
d['total_matric'] = d['matric_persons'] + d['intermediate_persons']+ d['non_tech_diploma_persons'] + d['tech_diploma_persons']

In [20]:
code = d[['state_code','area_name']].copy()

In [21]:
d = d[['state_code','area_name','total_literate','below_primary_persons','primary_persons','middle_persons','total_matric','graduate_and_above_persons']].copy()

In [107]:
newData2 = pd.DataFrame(columns = ['state','Area','Edu-level','T_persons'])

In [109]:
names = new_data2['Area'].to_list()

In [111]:
for state in names:
    test = new_data2[new_data2['Area']==state].copy()
    a = test[test['Edu-level']=='Illiterate']['T_persons'].to_list()[-1]
    b =  test[test['Edu-level']=='Literate']['T_persons'].to_list()[-1]
    idx = test.index[test['Edu-level'] == 'Literate'].to_list()[-1]
    test.at[idx,'T_persons'] = int(a+b)
    test = test[test['Edu-level']!='Illiterate'].copy()
    c = pd.concat([newData2,test],ignore_index=True)
    newData2 = c.copy(deep=True)

In [116]:
newData2.drop_duplicates(subset =['state','Area','Edu-level','T_persons'],keep = 'first', inplace = True)

In [119]:
new_data2 = newData2.copy(deep=True)

In [129]:
new_data2 = new_data2[new_data2['Edu-level']!='Total'].copy()

In [130]:
new_data2.head()

  state   Area                            Edu-level T_persons
1    00  INDIA                             literate  86009580
2    00  INDIA           literate but below primary   3733616
3    00  INDIA             primary but below middle   8636296
4    00  INDIA    middle but below matric/secondary  10743350
5    00  INDIA  matric/secondary but below graduate  33899219

In [131]:
d.head()

,state_code,area_name,literate,literate but below primary,primary but below middle,middle but below matric/secondary,matric/secondary but below graduate,graduate and above
6,00,INDIA,1249039778,146897597,184170833,133903266,192193344,68288971
93,01,State - JAMMU & KASHMIR,12770694,987774,1285909,1666381,2244013,653764
180,02,State - HIMACHAL PRADESH,7004262,611475,1162995,826611,1852386,446609
267,03,State - PUNJAB,28351904,2227684,4288200,3066305,6755536,1760846
354,04,State - CHANDIGARH,1068332,90869,130243,111879,265112,194453

In [132]:
col_list = ['state_code', 'area_name','literate', 'literate but below primary','primary but below middle', 'middle but below matric/secondary', 'matric/secondary but below graduate', 'graduate and above']

In [133]:
d.columns = col_list

In [134]:
d.head()

,state_code,area_name,literate,literate but below primary,primary but below middle,middle but below matric/secondary,matric/secondary but below graduate,graduate and above
6,00,INDIA,1249039778,146897597,184170833,133903266,192193344,68288971
93,01,State - JAMMU & KASHMIR,12770694,987774,1285909,1666381,2244013,653764
180,02,State - HIMACHAL PRADESH,7004262,611475,1162995,826611,1852386,446609
267,03,State - PUNJAB,28351904,2227684,4288200,3066305,6755536,1760846
354,04,State - CHANDIGARH,1068332,90869,130243,111879,265112,194453

In [135]:
new_data2['Edu-level'] = new_data2['Edu-level'].str.lower()

In [136]:
new_data2

,state,Area,Edu-level,T_persons
1,00,INDIA,literate,86009580
2,00,INDIA,literate but below primary,3733616
3,00,INDIA,primary but below middle,8636296
4,00,INDIA,middle but below matric/secondary,10743350
5,00,INDIA,matric/secondary but below graduate,33899219
...,...,...,...,...
1962,35,ANDAMAN & NICOBAR ISLANDS,literate but below primary,3567
1963,35,ANDAMAN & NICOBAR ISLANDS,primary but below middle,8570
1964,35,ANDAMAN & NICOBAR ISLANDS,middle but below matric/secondary,13994
1965,35,ANDAMAN & NICOBAR ISLANDS,matric/secondary but below graduate,30717
1966,35,ANDAMAN & NICOBAR ISLANDS,graduate and above,13335

In [137]:
col_list = col_list[2:]

In [138]:
def add(full):
    ahem = d[full].to_list()
    k=0
    for index, row in new_data2.iterrows():
        if row["Edu-level"]==full:
            new_data2.loc[index, 'total'] = ahem[k]
            k+=1

In [139]:
for name in col_list:
    add(name)

In [142]:
new_data2['percentage'] = (new_data2['T_persons']/new_data2['total'])*100

In [144]:
new_data2['max_column'] = new_data2.groupby(['Area'])['percentage'].transform('max')

In [145]:
new_data2 = new_data2[new_data2['percentage'] == new_data2['max_column']].copy()

In [146]:
new_data2 = new_data2.drop(['Area','T_persons','total','max_column'],axis=1)

In [147]:
new_data2 = new_data2.rename(columns={'state':'state/ut','Edu-level':'literacy-group'})

In [149]:
new_data2.to_csv('literacy-india.csv',index=False)